/*    2 - б
   В файле  WORK содержатся результаты работы цеха за день. 
      Элемент файла включает: шифр изделия ( 8 - символьный код ), 
      наименование изделия, количество (штук). 
   Построить таблицу, содержащую результаты работы за день, считая ключом шифр изделия. 
   Элемент таблицы имеет ту же структуру, что и элемент файла. 
   Содержащаяся в файле информация с равными ключами должны быть помещена в 
   таблицу один раз с общим количеством штук изделия. 
   Организовать таблицу как упорядоченную
*/

/*
   Основные операциинад таблицами: 
      1. Поиск в таблице элемента с заданным ключом.
      2. Включение заданного элемента в таблицу.
      3. Исключение из таблицы элемента с заданным ключом.
*/

int main()
{
   return 0;
}